olliw42/stm32ll-lib/stdstm32-uart-template.h
#ifdef UART$_INVERTED
#ifdef UART$_USE_TX
  LL_USART_SetTXPinLevel(UART$_UARTx, LL_USART_TXPIN_LEVEL_INVERTED);
#endif
#ifdef UART$_USE_RX
  LL_USART_SetRXPinLevel(UART$_UARTx, LL_USART_RXPIN_LEVEL_INVERTED);
#endif
#endif

  // Configure NVIC channel
#if defined UART$_USE_RX || defined UART$_USE_TX_ISR
#ifdef UART$_PREEMPTIONPRIORITY
  #error Legacy UART$_PREEMPTIONPRIORITY used !
#endif
#ifdef UART$_SUBPRIORITY
  #error Legacy UART$_SUBPRIORITY used !
#endif
#ifdef UART$_PRIORITY
#error Legacy UART$_PRIORITY used !
#endif
#ifndef UART$_IRQ_PRIORITY
  #define UART$_IRQ_PRIORITY  15 // set priority to lowest
#endif
  nvic_irq_enable_w_priority(UART$_IRQn, UART$_IRQ_PRIORITY);
#endif

#ifdef UART$_USE_TX_ISR
  // Disable Transmit Data Register empty interrupt
  LL_USART_DisableIT_TXE(UART$_UARTx);
  LL_USART_DisableIT_TC(UART$_UARTx);
  LL_USART_ClearFlag_TC(UART$_UARTx);
  // Flush buffer
  uart$_txwritepos = uart$_txreadpos = 0;
#endif

#ifdef UART$_USE_RX
  // Disable Receive Data register not empty interrupt
  LL_USART_DisableIT_RXNE(UART$_UARTx);
#ifdef STM32F1
  LL_USART_ClearFlag_RXNE(UART$_UARTx);
#endif
  // Flush buffer
  uart$_rxwritepos = uart$_rxreadpos = 0;
#ifdef UART$_USE_RXERRORCOUNT
  uart$_errorcnt_rxnoise = 0;
  uart$_errorcnt_rxframe = 0;
  uart$_errorcnt_rxoverrun = 0;
#endif
#endif

  // Cube HAL for f103rc
  /* In asynchronous mode, the following bits must be kept cleared:
     - LINEN and CLKEN bits in the USART_CR2 register,
     - SCEN, HDSEL and IREN  bits in the USART_CR3 register.*/
  CLEAR_BIT(UART$_UARTx->CR2, USART_CR2_CLKEN);
  CLEAR_BIT(UART$_UARTx->CR3, USART_CR3_HDSEL);
#if defined USART_CR2_LINEN
  CLEAR_BIT(UART$_UARTx->CR2, USART_CR2_LINEN);
#endif
#if defined USART_CR3_SCEN || defined USART_CR3_IREN // assume that always both are defined
  CLEAR_BIT(UART$_UARTx->CR3, (USART_CR3_SCEN | USART_CR3_IREN));
#endif

#if defined STM32F7
  // reading the F722 manual I've added this
  CLEAR_BIT(UART$_UARTx->CR1, (USART_CR1_EOBIE | USART_CR1_RTOIE | USART_CR1_CMIE | USART_CR1_PEIE | USART_CR1_IDLEIE));
  CLEAR_BIT(UART$_UARTx->CR2, (USART_CR2_RTOEN | USART_CR2_CPOL | USART_CR2_CPHA | USART_CR2_LBCL | USART_CR2_LBDIE | USART_CR2_LBDL));
  CLEAR_BIT(UART$_UARTx->CR3, (USART_CR3_TCBGTIE | USART_CR3_CTSIE | USART_CR3_EIE));
#if !defined UART$_USE_RXERRORCOUNT
  // Disable ORE in the first place
  LL_USART_DisableOverrunDetect(UART$_UARTx); // disables ORE, check how F1 is behaving
#endif
#endif

#if defined STM32G4 || defined STM32F3 || defined STM32WL || defined STM32F0 || defined STM32H5
#if !defined UART$_USE_RXERRORCOUNT
  LL_USART_DisableOverrunDetect(UART$_UARTx);
#endif
#endif

  // Enable USART/LPUART
  LL_USART_Enable(UART$_UARTx);

#if defined STM32G4 ||defined STM32F3 || defined STM32WL || defined STM32F0 || defined STM32H5
  // Polling UART/LPUART initialisation
  while((!(LL_USART_IsActiveFlag_TEACK(UART$_UARTx))) || (!(LL_USART_IsActiveFlag_REACK(UART$_UARTx)))) {};
#endif
}


void uart$_init(void)
{
  uart$_init_isroff();
  uart$_rx_enableisr(ENABLE);
}


//-------------------------------------------------------
// System bootloader
//-------------------------------------------------------
// AN2606 Application note: STM32 microcontroller system memory boot mode

#if defined STM32F1
  // STM32F10xx
  #if defined UART$_USE_UART1_PA9PA10
    #define UART$_HAS_SYSTEMBOOT
  #endif
  // STM32F105xx/107x
  // STM32F10xxx XL-densit
  // TODO

#elif defined STM32F3
  // STM32F302xB(C)/303xB(C)
  #if defined UART$_USE_UART1_PA9PA10 || defined UART$_USE_UART2_PD5PD6
    #define UART$_HAS_SYSTEMBOOT
  #endif
  // STM32F301xx/302x4(6/8)
  // STM32F302xD(E)/303xD(E)
  // STM32F303x4(6/8)/334xx/328xx
  //#if defined UART$_USE_UART1_PA9PA10 || defined UART$_USE_UART2_PA2PA3
  //  #define UART$_HAS_SYSTEMBOOT
  //#endif

#elif defined STM32F7

  #error TODO

#elif defined STM32G4
  // STM32G431xx/441x
  // STM32G47xxx/48xx
  // STM32G491xx/4A1x
  #if defined UART$_USE_UART1_PA9PA10 || defined UART$_USE_UART2_PA2PA3 || defined UART$_USE_UART3_PC10PC11
    #define UART$_HAS_SYSTEMBOOT
  #endif

#elif defined STM32L4
  // STM32L412xx/422x
  // STM32L43xxx/44xx
  // STM32L45xxx/46xxx
  // STM32L47xxx/48xx
  #if defined UART$_USE_UART1_PA9PA10 || defined UART$_USE_UART2_PA2PA3 || defined UART$_USE_UART3_PC10PC11
    #define UART$_HAS_SYSTEMBOOT
  #endif

#elif defined STM32WL
  // STM32WLE5xx/55x
  #if defined UART$_USE_UART1_PA9PA10 || defined UART$_USE_UART2_PA2PA3
    #define UART$_HAS_SYSTEMBOOT
  #endif

#elif defined STM32F0
  // STM32F070x6
  // STM32F070xB
  // STM32F071xx/072x
  #if defined UART$_USE_UART1_PA9PA10 || defined UART$_USE_UART2_PA14PA15
    #define UART$_HAS_SYSTEMBOOT
  #endif
  // STM32F09xxx
  // TODO

#elif defined STM32H5_H56x
  // STM32H562xx/563xx/573xx (per AN2606 Table 111)
  // the bootloader USART3 pins are PD8/PD9, not bonded up to LQFP64
  #if defined UART$_USE_UART1_PA9PA10 || defined UART$_USE_UART2_PA2PA3
    #define UART$_HAS_SYSTEMBOOT
  #endif

#elif defined STM32H5
  // STM32H503xx (per AN2606 Table 121)
  // ATTENTION: the bootloader USART2 pins are PA5/PA15, NOT the usual PA2/PA3
  #if defined UART$_USE_UART1_PA9PA10 || defined UART$_USE_UART2_PA5PA15 || defined UART$_USE_UART3_PA4PA3
    #define UART$_HAS_SYSTEMBOOT
  #endif

#endif


uint8_t uart$_has_systemboot(void)
{
#ifdef UART$_HAS_SYSTEMBOOT
    return 1;
#else
    return 0;
#endif
}


//-------------------------------------------------------
#ifdef __cplusplus
}
#endif
#endif // STDSTM32_UART$_H
